<?php

namespace Hotel\reserveBundle\Form;

use Symfony\Component\Form\AbstractType;
use Symfony\Component\Form\FormBuilderInterface;
use Symfony\Component\OptionsResolver\OptionsResolverInterface;
use Symfony\Component\Validator\Constraints\Length;
use Symfony\Component\Validator\Constraints\NotBlank;

class roomEntityType extends AbstractType
{
    /**
     * @param FormBuilderInterface $builder
     * @param array $options
     */
    public function buildForm(FormBuilderInterface $builder, array $options)
    {
        $builder
            ->add('room_name', null, array('constraints' => array(
                new NotBlank(),
                new Length(array('max' => 63)))))

            ->add('room_capacity', null, array('constraints' => array(
                new NotBlank())))

            ->add('room_addCapacity', null, array('constraints' => array(
                new NotBlank())))

            ->add('room_type', 'choice', array('choices' => array(
                '1' => 'سوئيت1', '2' => 'سوئيت2', '3' => 'سوئيت3', '4' => 'سوئيت vip1',
                '5' => 'سوئيت vip2', '6' => 'سوئيت vip3', '7' => 'سوئيت جونيور1', '8' => 'سوئيت جونيور2',
                '9' => 'سوئيت جونيور3', '10' => 'سوئيت پرزيدنت1', '11' => 'سوئيت پرزيدنت2', '12' => 'سوئيت پرزيدنت3',
                '13' => 'سوئيت رويال1', '14' => 'سوئيت رويال2', '15' => 'سوئيت رويال3', '16' => 'سوئيت امپريال1',
                '17' => 'سوئيت امپريال2', '18' => 'سوئيت امپريال3', '19' => 'سوئيت لاکچري1', '20' => 'سوئيت لاکچري2',
                '21' => 'سوئيت لاکچري3', '22' => 'سوئيت دوبلکس1', '23' => 'سوئيت دوبلکس2', '24' => 'سوئيت دوبلکس3',
                '25' => 'سوئيت لوکس1', '26' => 'سوئيت لوکس2', '27' => 'سوئيت لوکس3', '28' => 'پرنسس روم1',
                '29' => 'پرنسس روم2', '30' => 'پرنسس روم3', '31' => 'پرزيدنتال1', '32' => 'پرزيدنتال2',
                '33' => 'پرزيدنتال3', '34' => 'تريپل1', '35' => 'تريپل2', '36' => 'تريپل3', '37' => 'سينگل1',
                '38' => 'سينگل2', '39' => 'سينگل3', '40' => 'دبل1', '41' => 'دبل2', '42' => 'دبل3', '43' => 'کانکت روم1',
                '44' => 'کانکت روم2', '45' => 'کانکت روم3', '46' => 'آپارتمان1', '47' => 'آپارتمان2', '48' => 'آپارتمان3',
                '49' => 'آپارتمان رويال1', '50' => 'آپارتمان رويال2', '51' => 'آپارتمان رويال3')
            ));
    }

    /**
     * @param OptionsResolverInterface $resolver
     */
    public function setDefaultOptions(OptionsResolverInterface $resolver)
    {
        $resolver->setDefaults(array(
            'data_class' => 'Hotel\reserveBundle\Entity\roomEntity'
        ));
    }

    /**
     * @return string
     */
    public function getName()
    {
        return 'hotel_reservebundle_roomentity';
    }
}

//array(
//    '1' => 'سوئيت1',
//    '2' => 'سوئيت2',
//    '3' => 'سوئيت3',
//    '4' => 'سوئيت vip1',
//    '5' => 'سوئيت vip2',
//    '6' => 'سوئيت vip3',
//    '7' => 'سوئيت جونيور1',
//    '8' => 'سوئيت جونيور2',
//    '9' => 'سوئيت جونيور3',
//    '10' => 'سوئيت پرزيدنت1',
//    '11' => 'سوئيت پرزيدنت2',
//    '12' => 'سوئيت پرزيدنت3',
//    '13' => 'سوئيت رويال1',
//    '14' => 'سوئيت رويال2',
//    '15' => 'سوئيت رويال3',
//    '16' => 'سوئيت امپريال1',
//    '17' => 'سوئيت امپريال2',
//    '18' => 'سوئيت امپريال3',
//    '19' => 'سوئيت لاکچري1',
//    '20' => 'سوئيت لاکچري2',
//    '21' => 'سوئيت لاکچري3',
//    '22' => 'سوئيت دوبلکس1',
//    '23' => 'سوئيت دوبلکس2',
//    '24' => 'سوئيت دوبلکس3',
//    '25' => 'سوئيت لوکس1',
//    '26' => 'سوئيت لوکس2',
//    '27' => 'سوئيت لوکس3',
//    '28' => 'پرنسس روم1',
//    '29' => 'پرنسس روم2',
//    '30' => 'پرنسس روم3',
//    '31' => 'پرزيدنتال1',
//    '32' => 'پرزيدنتال2',
//    '33' => 'پرزيدنتال3',
//    '34' => 'تريپل1',
//    '35' => 'تريپل2',
//    '36' => 'تريپل3',
//    '37' => 'سينگل1',
//    '38' => 'سينگل2',
//    '39' => 'سينگل3',
//    '40' => 'دبل1',
//    '41' => 'دبل2',
//    '42' => 'دبل3',
//    '43' => 'کانکت روم1',
//    '44' => 'کانکت روم2',
//    '45' => 'کانکت روم3',
//    '46' => 'آپارتمان1',
//    '47' => 'آپارتمان2',
//    '48' => 'آپارتمان3',
//    '49' => 'آپارتمان رويال1',
//    '50' => 'آپارتمان رويال2',
//    '51' => 'آپارتمان رويال3')